import Svg,{
    G,
    Path
} from "react-native-svg";

import React from "react";

export default class CircleTest extends React.Component {
    constructor(props) {
        super(props);
    }

    render() {
        return (
            <Svg width="100%" height="100%" viewBox="0 0 953.85 953.85">
                <G id="Слой_2" data-name="Слой 2">
                    <G id="Слой_1-2" data-name="Слой 1">
                        <Path fill="#faed63"
                              d="M178.19,476.92c0-.12,0-.25,0-.37L0,476.18c0,.25,0,.49,0,.74C0,739.39,213.12,953,475.4,953.84l.37-178.2C311.58,775,178.19,641.26,178.19,476.92Z"/>
                        <Path fill="#009667"
                              d="M0,476.18l178.19.37c.2-164.21,133.57-297.79,297.7-298.35V0C213.63.57.4,213.89,0,476.18Z"/>
                        <Path fill="#009667"
                              d="M775.64,477.79l177.5.37-177.5-.37c-.47,164.32-134.29,297.86-298.72,297.86h-1.15l-.37,178.2h1.52c263,0,476.92-213.95,476.92-476.92H775.65C775.65,477.21,775.64,477.5,775.64,477.79Z"/>
                        <Path fill="#faed63"
                              d="M476.92,0h-1V178.2H477L477.38.42,477,178.19c164.68,0,298.64,134,298.64,298.73H953.85C953.85,213.95,739.9,0,476.92,0Z"/>
                    </G>
                </G>
            </Svg>
        );
    }
}